src/Documents/ТелефонныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ТелефонныйЗвонок</Name>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.СообщениеSMS</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АбонентКакСвязаться</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.Рассылка</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОтветственного</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпCoMagicID</Name>
					<Comment>Идентификатор контакта в системе CoMagic</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпДлительностьЗвонка</Name>
					<Comment>Длительность звонка в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗаписи</Name>
					<Comment>Идентификатор записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпСостояниеЗвонка</Name>
					<Comment>Состояние звонка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.сфпСостоянияЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/сфпИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>сфпИсторияЗвонков</Name>
			<Comment>История звонков СофтФон</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Comment>Внутренний номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Comment>Дата ответа на звонок</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Comment>Идентификатор записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.СтроковыеКонтактыВзаимодействий</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Звонок</Name>
					<Comment>Телефонный звонок</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ТелефонныйЗвонок/Forms/сфпФормаДокумента/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ.

// +Отключаем ряд функций CoMagic

//&НаСервере
//// Процедура пытается найти контакт по ID CoMagic и заполнить в Событии.
////
//// Параметры:
////	Нет.
////
//Процедура сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic()
//	Контакт = сфпСофтФонПроСервер.сфпНайтиКонтактПоIDИзCoMagic(сфпСтруктураВнешнихДанных.comagic_context.visitor_id);
//	Если ЗначениеЗаполнено(Контакт) Тогда
//		Объект.АбонентКонтакт = Контакт.Ссылка;
//	КонецЕсли;
//КонецПроцедуры // сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic()	

// -Отключаем ряд функций CoMagic

&НаСервере
// Процедура заполняет таблицу истории звонка.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьИсториюЗвонка()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Звонок", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрСведенийсфпИсторияЗвонков.ДатаНачала КАК ДатаНачала,
	               |	РегистрСведенийсфпИсторияЗвонков.ДатаОтвета,
	               |	РегистрСведенийсфпИсторияЗвонков.ВнутреннийНомер,
	               |	ВЫБОР
	               |		КОГДА РегистрСведенийсфпИсторияЗвонков.ДатаОтвета = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РегистрСведенийсфпИсторияЗвонков.ДатаНачала, ДЕНЬ), СЕКУНДА, РАЗНОСТЬДАТ(РегистрСведенийсфпИсторияЗвонков.ДатаНачала, РегистрСведенийсфпИсторияЗвонков.ДатаОкончания, СЕКУНДА))
	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РегистрСведенийсфпИсторияЗвонков.ДатаНачала, ДЕНЬ), СЕКУНДА, РАЗНОСТЬДАТ(РегистрСведенийсфпИсторияЗвонков.ДатаОтвета, РегистрСведенийсфпИсторияЗвонков.ДатаОкончания, СЕКУНДА))
	               |	КОНЕЦ КАК Длительность,
	               |	РегистрСведенийсфпИсторияЗвонков.ИдентификаторЗаписи,
	               |	РегистрСведенийсфпИсторияЗвонков.Ответственный,
	               |	РегистрСведенийсфпИсторияЗвонков.Входящий,
	               |	РегистрСведенийсфпИсторияЗвонков.ДатаОкончания,
	               |	РегистрСведенийсфпИсторияЗвонков.НомерТелефона,
	               |	РегистрСведенийсфпИсторияЗвонков.Звонок,
	               |	РегистрСведенийсфпИсторияЗвонков.ИдентификаторЗвонка
	               |ИЗ
	               |	РегистрСведений.сфпИсторияЗвонков КАК РегистрСведенийсфпИсторияЗвонков
	               |ГДЕ
	               |	РегистрСведенийсфпИсторияЗвонков.Звонок = &Звонок
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачала";
	сфпИсторияЗвонка.Очистить();				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = сфпИсторияЗвонка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	КоличествоЗвонковИстории = сфпИсторияЗвонка.Количество();
	Если КоличествоЗвонковИстории = 2 Тогда
		ТекЗвонок = сфпИсторияЗвонка[КоличествоЗвонковИстории-2].Звонок;
		Если ТекЗвонок.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный Тогда
			ТекЗвонок = сфпИсторияЗвонка[КоличествоЗвонковИстории-1].Звонок;
			Если ТекЗвонок.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный 
			И НЕ Объект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный Тогда
				Объект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьИсториюЗвонка()

&НаКлиенте
// Процедура заполняет значения реквизитов истории звонка.
//
// Параметры:
//	Нет.
//
Процедура УстановитьДоступностьРеквизитовЗвонка()
	Элементы.ПредыдущаяЗапись.Доступность	= Ложь;
	Элементы.СледующаяЗапись.Доступность		= Ложь;
	Элементы.ОписаниеЗвонка.Гиперссылка		= Ложь;
	КоличествоСтрок = сфпИсторияЗвонка.Количество();
	Если КоличествоСтрок > 0 Тогда
		Если КоличествоСтрок > 1 Тогда
			Элементы.ОписаниеЗвонка.Гиперссылка = Истина;
		КонецЕсли;	
		Если сфпНомерСтроки > 0 Тогда
			Элементы.ПредыдущаяЗапись.Доступность = Истина;
		КонецЕсли;
		Если сфпНомерСтроки < КоличествоСтрок - 1 Тогда
			Элементы.СледующаяЗапись.Доступность	= Истина;
		КонецЕсли;
		Элементы.ОписаниеЗвонка.Заголовок = НСтр("ru='Разговор ('") + Строка(сфпНомерСтроки + 1) +Символы.НПП + НСтр("ru = 'из'") + Символы.НПП + Строка(КоличествоСтрок) + ") ";
		Если ПустаяСтрока(сфпИсторияЗвонка[сфпНомерСтроки].ИдентификаторЗаписи) Тогда
			Если сфпСофтФонПроСервер.сфпИспользоватьCLON() Тогда
				Элементы.ПрослушатьЗаписьРазговора.Видимость = Истина;
			Иначе	
				Элементы.ПрослушатьЗаписьРазговора.Видимость = Ложь;
			КонецЕсли;	
		Иначе
			Элементы.ПрослушатьЗаписьРазговора.Видимость = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры // УстановитьДоступностьРеквизитовЗвонка()

&НаКлиенте
// Процедура заполняет значения реквизитов истории звонка.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьЗначенияРеквизитовЗвонка()
	КоличествоСтрок = сфпИсторияЗвонка.Количество();
	Если (КоличествоСтрок > 0) И (сфпНомерСтроки < КоличествоСтрок) Тогда
		сфпОтветственный		= сфпИсторияЗвонка[сфпНомерСтроки].Ответственный;
		сфпЛиния				= сфпИсторияЗвонка[сфпНомерСтроки].ВнутреннийНомер;
		сфпДатаОтвета			= сфпИсторияЗвонка[сфпНомерСтроки].ДатаОтвета;
		сфпДлительностьЗвонка	= сфпИсторияЗвонка[сфпНомерСтроки].Длительность;
		Если (КоличествоСтрок = 1) И (сфпДлительностьЗвонка = Дата('00010101')) Тогда
			сфпДлительностьЗвонка	= сфпДлительность;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // ЗаполнитьЗначенияРеквизитовЗвонка()

&НаКлиенте
// Процедура - обработчик выбора разговора из меню.
//
// Параметры:
//	ВыбранныйЭлемент		- ЭлементСпискаЗначений	- Выбранный разговор.
//	ДополнительныеПараметры	- Структура				- Структура дополнительных параметров.
//
Процедура ОбработкаВыбораРазговора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	сфпНомерСтроки	= ВыбранныйЭлемент.Значение;	
	ЗаполнитьЗначенияРеквизитовЗвонка();
	УстановитьДоступностьРеквизитовЗвонка();
КонецПроцедуры // ОбработкаВыбораРазговора()	

&НаСервере
// Процедура вычисляет владельца контакта и отображает его в форме документа
//
Процедура сфпЗаполнитьВладельцаКонтакта()
	Если ЗначениеЗаполнено(Объект.АбонентКонтакт) 
	И ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВладелецКонтакта = сфпСофтФонПроСервер.сфпПолучитьВладельца(Объект.АбонентКонтакт);
		Если ЗначениеЗаполнено(ВладелецКонтакта) Тогда
			Элементы.сфпВладелец.Видимость = Истина;
			сфпВладелец = ВладелецКонтакта;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
// Процедура управляет видимостью кнопок "Создать Партнера" и "Добавить телефон"
//
Процедура сфпУправлениеВидимостьюКнопокДобавления()
	Если НЕ ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		Элементы.СоздатьПартнера.Видимость = Истина;
	Иначе
		Элементы.СоздатьПартнера.Видимость = Ложь;
	КонецЕсли;		
	Элементы.ДобавитьТелефон.Видимость = сфпСофтФонПроСервер.сфпПроверитьНаличиеНомераТелефонаУАбонента(Объект.АбонентКонтакт, Объект.АбонентКакСвязаться);
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура добавляет номер телефона из поля "Как связаться" в объект из поля "Контакт"
//
//   Параметры:
//    СсылкаКИ 		- СправочникСсылка 	- Объект, к которому добавляется телефон
//	  НомерТелефона - Строка			- Добавляемый номер телефона
//
Процедура ДобавитьТелефонНаСервер(СсылкаКИ, НомерТелефона)
	ОбъектКИ = СсылкаКИ.ПолучитьОбъект();
	НомерТелефона = СокрЛП(НомерТелефона);
	Если ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		НоваяКИ.Вид	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;
		ОбъектКИ.Записать();
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Сотрудники") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);	
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонСотрудника");
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;
		ОбъектКИ.Записать();
	ИначеЕсли ТипЗнч(СсылкаКИ) = Тип("СправочникСсылка.Пользователи") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(НомерТелефона);
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
		НоваяКИ = ОбъектКИ.КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя");
		Иначе	
			НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_ТелефонПользователяРабочий");
		КонецЕсли;		
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны),СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;
		НоваяКИ.НомерТелефона = Телефон;
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;
		ОбъектКИ.Записать();
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура сфпРазрешеныИзмененияВДокументе()
	ТекПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Если ТекПользователь <> Объект.Ответственный И Не Пользователи.РолиДоступны("ПолныеПрава, сфпУправлениеМаршрутизацией") Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ОписаниеЗвонка".
//
Процедура ОписаниеЗвонкаНажатие(Элемент)
	СписокРазговоров = Новый СписокЗначений;
	текНомерСтроки = 0;
	Для Каждого СтрокаЗвонка Из сфпИсторияЗвонка Цикл
		ОписаниеРазговора = Строка(текНомерСтроки + 1) + ". " + Строка(СтрокаЗвонка.Ответственный) 
		+ " (" + Строка(СтрокаЗвонка.ВнутреннийНомер) + "): " 
		+ Формат(СтрокаЗвонка.Длительность, "ДЛФ=T; ДП=0:00:00");
		Если ПустаяСтрока(СтрокаЗвонка.ИдентификаторЗаписи) Тогда
			Если сфпСофтФонПроСервер.сфпИспользоватьCLON() Тогда
				СписокРазговоров.Добавить(текНомерСтроки, ОписаниеРазговора, , БиблиотекаКартинок.ЖурналРегистрации);
			Иначе	
				СписокРазговоров.Добавить(текНомерСтроки, ОписаниеРазговора);
			КонецЕсли;	
		Иначе
			СписокРазговоров.Добавить(текНомерСтроки, ОписаниеРазговора, , БиблиотекаКартинок.ЖурналРегистрации);
		КонецЕсли;	
	КонецЦикла;	
	ДополнительныеПараметры	= Новый Структура;
	ОповещениеВыбораИзМеню	= Новый ОписаниеОповещения("ОбработкаВыбораРазговора", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзМеню(ОповещениеВыбораИзМеню, СписокРазговоров, Элемент);
КонецПроцедуры // ОписаниеЗвонкаНажатие()

&НаКлиенте
Процедура АбонентКонтактПриИзменении(Элемент)
	сфпЗаполнитьВладельцаКонтакта();
	сфпУправлениеВидимостьюКнопокДобавления();
КонецПроцедуры

&НаКлиенте
Процедура АбонентКонтактОчистка(Элемент, СтандартнаяОбработка)
	Элементы.сфпВладелец.Видимость = Ложь;
	сфпВладелец = Неопределено;
	сфпУправлениеВидимостьюКнопокДобавления();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ.

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()


&НаКлиенте
// Процедура - обработчик команды формы "ПредыдущаяЗапись".
//
Процедура ПредыдущаяЗапись(Команда)
	Если сфпНомерСтроки > 0 Тогда
		сфпНомерСтроки = сфпНомерСтроки - 1;
		ЗаполнитьЗначенияРеквизитовЗвонка();
		УстановитьДоступностьРеквизитовЗвонка();
	КонецЕсли;
КонецПроцедуры // ПредыдущаяЗапись()

&НаКлиенте
// Процедура - обработчик команды формы "ПрослушатьЗаписьРазговора".
//
Процедура ПрослушатьЗаписьРазговора(Команда)
	ТД = сфпИсторияЗвонка[сфпНомерСтроки];
	// Прежде, чем искать запись мы должны выяснить, есть ли права на прослушку у данного пользователя.
	ТекПользователь = сфпСофтФонПроСервер.сфпТекущийПользователь();
	МассивПрослушиваемыхПользователей = сфпСофтФонПроСервер.сфпПолучитьМассивПрослушиваемыхПользователей(ТекПользователь);
	Если МассивПрослушиваемыхПользователей.Количество() > 0 Тогда
		Если МассивПрослушиваемыхПользователей.Найти(Объект.Ответственный) = Неопределено Тогда
			ТекстПредупреждения = НСтр("ru = 'У данного пользователя нет прав на прослушивание разговора пользователя'")+ Символы.НПП + """" + Строка(Объект.Ответственный) + """" + ".";
			ПоказатьПредупреждение(,ТекстПредупреждения);
			Возврат;
		КонецЕсли;
	Иначе
		ТекстПредупреждения = НСтр("ru = 'У данного пользователя нет прав на прослушивание разговора пользователя'")+ Символы.НПП + """" + Строка(Объект.Ответственный) + """" + ".";
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;	
	Если ПустаяСтрока(ТД.ИдентификаторЗаписи) Тогда
		Если сфпСофтФонПроСервер.сфпИспользоватьCLON() Тогда
			Если ТД.Входящий Тогда
				ТелефонА	= ТД.НомерТелефона;
				ТелефонБ	= ТД.ВнутреннийНомер;
			Иначе
				ТелефонА	= ТД.ВнутреннийНомер;
				ТелефонБ	= ТД.НомерТелефона;
			КонецЕсли;
			// Выполняем поиск записи разговора
			НайденнаяЗапись = сфпСофтФонПроКлиент.сфпНайтиЗаписьРазговораCLON(ТелефонА, ТелефонБ,  ТД.ДатаНачала, ТД.ДатаОкончания, ТД.Входящий); 
			Если НЕ (НайденнаяЗапись = Неопределено) Тогда
				// Запускаем запись на прослушивание
				сфпСофтФонПроКлиент.сфпПолучитьФайлРазговора(НайденнаяЗапись.file);
				// Записываем в регистр идентификатор записи
				сфпСофтФонПроСервер.сфпЗаписатьИдентификаторЗаписиВРегистр(ТД.Звонок, ТД.ИдентификаторЗвонка, НайденнаяЗапись.file);
				// Обновляем историю звонка
				ЗаполнитьИсториюЗвонка();
				ЗаполнитьЗначенияРеквизитовЗвонка();
				УстановитьДоступностьРеквизитовЗвонка();
			КонецЕсли;
		КонецЕсли;	
	Иначе
		сфпСофтФонПроКлиент.сфпПолучитьФайлРазговора(ТД.ИдентификаторЗаписи)
	КонецЕсли;	
КонецПроцедуры // ПрослушатьЗаписьРазговора()

&НаКлиенте
// Процедура - обработчик команды формы "СледующаяЗапись".
//
Процедура СледующаяЗапись(Команда)
	КоличествоСтрок = сфпИсторияЗвонка.Количество() - 1;
	Если сфпНомерСтроки < КоличествоСтрок Тогда
		сфпНомерСтроки = сфпНомерСтроки + 1;
		ЗаполнитьЗначенияРеквизитовЗвонка();
		УстановитьДоступностьРеквизитовЗвонка();
	КонецЕсли;
КонецПроцедуры // СледующаяЗапись()

// Процедура - обработчик команды формы "сфпЗагрузитьИсториюЗвонков".
//
&НаКлиенте
Процедура сфпЗагрузитьИсториюЗвонков(Команда)
	Если НЕ сфпСофтФонПроСервер.сфпРолиДоступны("ПолныеПрава, сфпУправлениеМаршрутизацией") Тогда
		ВывестиСообщение(НСтр("ru='Недостаточно прав для загрузки истории звонков.'"));
		Возврат;
	КонецЕсли;
	сфпСофтФонПроСервер.сфпПолучитьИсториюЗвонков();
КонецПроцедуры

// Процедура - обработчик команды формы "СоздатьПартнера".
//
&НаКлиенте
Процедура СоздатьПартнера(Команда)
	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьПартнераПослеВыбораТипаКонтакта", ЭтотОбъект);
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"), НСтр("ru = 'Контрагент'"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"), НСтр("ru = 'Пользователь'"));		
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"), НСтр("ru = 'Сотрудник'"));	
	ПоказатьВыборИзСписка(НовоеОповещение, СписокВыбора, Элементы.АбонентКонтакт, 1); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, вызываемая после ответа пользователя по выбору создания типа контакта
// 
// Параметры:
//   Результат 					- ЭлементСпискаЗначений - Тип выбранного контакта для создания
//   ДополнительныеПараметры 	- Структура - Структура с передаваемыми доп. параметрами
//
Процедура СоздатьПартнераПослеВыбораТипаКонтакта(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат КонецЕсли;
	Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Объект.АбонентКакСвязаться);;
	Если ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("Телефон", Телефон);
		СтруктураПараметры.Вставить("Наименование", Объект.АбонентПредставление);
		СтруктураПараметры.Вставить("Звонок", Объект.Ссылка);
		ФормаПартнера = ПолучитьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураПараметры), ЭтотОбъект);
		Если СтруктураПараметры.Свойство("Наименование") Тогда
			Если Не ЗначениеЗаполнено(ФормаПартнера.Объект.Наименование) Тогда
				ФормаПартнера.Объект.Наименование = СтруктураПараметры.Наименование;
			КонецЕсли;
		КонецЕсли;
		ФормаПартнера.Открыть();
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.Сотрудники") Тогда
		ФормаКонтакта = ПолучитьФорму("Справочник.Сотрудники.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка),ЭтотОбъект);
		ФормаКонтакта.Открыть();
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("СправочникСсылка.Пользователи") Тогда	
		ФормаКонтакта = ПолучитьФорму("Справочник.Пользователи.ФормаОбъекта",  Новый Структура("Основание", Объект.Ссылка), ЭтотОбъект);
		ФормаКонтакта.Открыть();
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ДобавитьТелефон".
//
Процедура ДобавитьТелефон(Команда)
	ДобавитьТелефонНаСервер(Объект.АбонентКонтакт, Объект.АбонентКакСвязаться);
	Элементы.ДобавитьТелефон.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор			= сфпСофтФонПроСервер.сфпТекущийПользователь();
		Объект.Ответственный	= сфпСофтФонПроСервер.сфпТекущийПользователь();
		Объект.Дата				= сфпСофтФонПроСервер.сфпТекущаяДата();
		Объект.Важность			= Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	КонецЕсли;
	Если Параметры.Свойство("АбонентКонтакт") И ЗначениеЗаполнено(Параметры.АбонентКонтакт) Тогда
		Объект.АбонентКонтакт = Параметры.АбонентКонтакт;
		Объект.АбонентПредставление = Строка(Объект.АбонентКонтакт);
		Модифицированность = Истина;
	КонецЕсли;	
	
	// +Рарус
	// Команда настройки дополнительных параметров объекта
	ЗащищенныеФункцииСервер.ДобавитьКоманду(ЭтотОбъект, "НастроитьПараметрыДокумента", "ФормаКоманднаяПанель", БиблиотекаКартинок.ПараметрыДокумента, НСтр("ru = 'Параметры'"), НСтр("ru = 'Расширенное редактирование параметров документа'"), ЛОЖЬ,,, ОтображениеКнопки.КартинкаИТекст);
	// -Рарус
	

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	сфпДлительность = Дата('00010101') + Объект.сфпДлительностьЗвонка;
	Заголовок = НСтр("ru='Звонок'");
	Если Объект.Входящий Тогда
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			Заголовок = Заголовок + Символы.НПП + НСтр("ru='входящий'") + Символы.НПП + "(" + НСтр("ru='пропущенный'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = НСтр("ru = 'Состояние: пропущенный'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Красный;
		Иначе	
			Заголовок = Заголовок + Символы.НПП + НСтр("ru='входящий'") + Символы.НПП + "(" + НСтр("ru='отвеченный'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = НСтр("ru = 'Состояние: отвеченный'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Зеленый;			
		КонецЕсли;	
	Иначе
		Если Объект.сфпСостояниеЗвонка = ПредопределенноеЗначение("Перечисление.сфпСостоянияЗвонков.Пропущенный") Тогда
			Заголовок = Заголовок +Символы.НПП + НСтр("ru='исходящий'") + Символы.НПП + "(" + НСтр("ru='не дозвонились'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = НСтр("ru = 'Состояние: не дозвонились'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Красный;
		Иначе	
			Заголовок = Заголовок + Символы.НПП + НСтр("ru='исходящий'") + Символы.НПП + "(" + НСтр("ru='отвеченный'") + ")";
			Элементы.ДекорацияСостояниеЗвонка.Заголовок = НСтр("ru = 'Состояние: отвеченный'");
			Элементы.ДекорацияСостояниеЗвонка.ЦветТекста = WebЦвета.Зеленый;						
		КонецЕсли;	
	КонецЕсли;
	Заголовок = Заголовок + ", " + Объект.АбонентПредставление + ", " + Формат(Объект.Дата, "ДЛФ=D") + "/" 
		+ Формат(Объект.Дата, "ДЛФ=T; ДП=0:00:00") + "/" + Формат(Дата('00010101') + Объект.сфпДлительностьЗвонка, "ДЛФ=T; ДП=0:00:00");
	сфпНомерСтроки	= 0;	
	ЗаполнитьИсториюЗвонка();
	ЗаполнитьЗначенияРеквизитовЗвонка();
	УстановитьДоступностьРеквизитовЗвонка();
	сфпЗаполнитьВладельцаКонтакта();
	сфпУправлениеВидимостьюКнопокДобавления();
	сфпРазрешеныИзмененияВДокументе();
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Процедура - обработчик события формы "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если (ИмяСобытия = "СофтФон_КонецРазговора") И Параметр.Свойство("Звонок") Тогда
		Если (Параметр.Звонок = Объект.Ссылка) Тогда
			Объект.сфпДлительностьЗвонка = сфпСофтФонПроСервер.сфпТекущаяДата() - Объект.Дата;
			сфпДлительность		= Дата('00010101') + Объект.сфпДлительностьЗвонка;
			Объект.Описание		= сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(Объект.сфпДлительностьЗвонка);																		
			Если ЗначениеЗаполнено(Элементы.Комментарий.ТекстРедактирования) Тогда
				Объект.Комментарий = Элементы.Комментарий.ТекстРедактирования;
			КонецЕсли;
			Если Параметр.Свойство("НовыйОтветственный") Тогда
				Объект.Ответственный = Параметр.НовыйОтветственный;
			КонецЕсли;
			Модифицированность	= Истина;
			ЗаполнитьИсториюЗвонка();
			ЗаполнитьЗначенияРеквизитовЗвонка();
			УстановитьДоступностьРеквизитовЗвонка();
		КонецЕсли;
	//ИначеЕсли (ИмяСобытия = "Софтфон_CoMagic") И Параметр.Свойство("Звонок") Тогда
	//	Если Параметр.Звонок = Объект.Ссылка Тогда
	//		Если (Объект.сфпДлительностьЗвонка = 0) И (сфпСтруктураВнешнихДанных = Неопределено) Тогда
	//			// Заполняем документ данными из CoMagic
	//			сфпСтруктураВнешнихДанных	= Параметр.СтруктураCoMagic;
	//			Объект.сфпCoMagicID			= сфпСтруктураВнешнихДанных.comagic_context.visitor_id;
	//			Объект.Описание = Объект.Описание + ?(ПустаяСтрока(Объект.Описание), "", Символы.ПС) 
	//				+ НСтр("ru='Кампания: '") + сфпСтруктураВнешнихДанных.comagic_context.campaign + Символы.ПС 
	//				+ НСтр("ru='Сайт: '") + сфпСтруктураВнешнихДанных.comagic_context.site + Символы.ПС
	//				+ НСтр("ru='Ключевые слова: '") + сфпСтруктураВнешнихДанных.comagic_context.search_query; 
	//			Если НЕ ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
	//				сфпЗаполнитьПартнераИКонтактноеЛицоИзCoMagic();
	//			КонецЕсли;			
	//			Модифицированность	= Истина;
	//		КонецЕсли;	
	//	КонецЕсли;	
	ИначеЕсли (ИмяСобытия = "ЗаполнитьКонтактВТелефонномЗвонке") И Параметр.Свойство("Звонок") Тогда
		Если Параметр.Звонок = Объект.Ссылка Тогда
			Объект.АбонентКонтакт 		= Параметр.Контакт;
			Объект.АбонентПредставление = Строка(Объект.АбонентКонтакт);
			Элементы.СоздатьПартнера.Видимость = Ложь;
			Модифицированность	= Истина;			
		КонецЕсли;			
	КонецЕсли;	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти
